{
   "1949": {
        "funny": "Популярность комиксов 'Супермен' возросла, и многие пытались найти свои собственные суперсилы.",
        "scary": "Создание НАТО повысило напряженность во время холодной войны."
    },
    "1948": {
        "funny": "Модные практики пинг-понга стали источником забавных ситуаций на вечеринках.",
        "scary": "Разделение Германии на западную и восточную создало угрозу для мирного сосуществования."
    },
    "1947": {
        "funny": "Год первой академической премии для студентов, что привело к неожиданным забавным моментам.",
        "scary": "Случай в Хиросиме стал символом страха перед ядерным оружием."
    },
    "1946": {
        "funny": "Появление манифестаций в стиле 'балаган', завоевавших популярность на улицах.",
        "scary": "После войны мир столкнулся с серьезными проблемами мира и восстановления."
    },
    "1945": {
        "funny": "Люди активно использовали новые модные повседневные наряды в духе 'ретро'.",
        "scary": "Вторая мировая война закончилась разрушениями и потерями миллионов."
    },
    "1944": {
        "funny": "Смешные случаи на фронте, когда солдаты нашли время для комедийных сцен.",
        "scary": "Нормандская высадка добавила страха и неопределенности к финалу войны."
    },
    "1943": {
        "funny": "Популярность 'рэкетирования' привела к забавным шуткам среди местных жителей.",
        "scary": "Ситуация с концентрационными лагерями привела к массовым гуманитарным катастрофам."
    },
    "1942": {
        "funny": "Процветание черного рынка привело к возникновению комичных ситуаций.",
        "scary": "Атаки на Перл-Харбор заставили мир встать на уши, напомнив о страхе войны."
    },
    "1941": {
        "funny": "Бум на модные поздравительные открытки с абсурдными текстами.",
        "scary": "Начало Второй мировой войны из-за нападения на Pearl Harbor."
    },
    "1940": {
        "funny": "Ситуации с экстравагантной одеждой стали основой для шуток и мемов.",
        "scary": "Франция капитулировала перед нацистами, вызвав массовую панику в Европе."
    },
    "1939": {
        "funny": "Первая официальная премьера 'Звёздных войн' стала причиной многих комических скетчей.",
        "scary": "Начало Второй мировой войны с заявлением Германии о войне с Польшей."
    },
    "1938": {
        "funny": "Актёрские выступления в стиле 'вечеринки' сделали шоу непредсказуемым.",
        "scary": "Аншлюс Австрии стал началом агрессивной политики Германии."
    },
    "1937": {
        "funny": "Смешные соревнования по еде стали популярны на местных ярмарках.",
        "scary": "Великий голод в Китае, унесший жизни миллионов людей."
    },
    "1936": {
        "funny": "Популярные танцы типа 'джайв' стали объектом для многих шуток.",
        "scary": "Гражданская война в Испании привела к глобальным последствиям."
    },
    "1935": {
        "funny": "Люди начали собирать множество всевозможных шуток о моде тех времен.",
        "scary": "Нацистская Германия начала проводить свои первые репрессии."
    },
    "1934": {
        "funny": "Создание первых зоопарков с абсурдными названиями породило улыбающиеся комментарии.",
        "scary": "Скорые репрессии в СССР стали символом страха и несвободы."
    },
    "1933": {
        "funny": "Мода на шутливые анонсы в газетах стала распространенной практикой.",
        "scary": "Приход к власти нацистов создал мракобесие и страх в Германии."
    },
    "1932": {
        "funny": "Создание первых комиксов о супергероях вызвало много смеха среди подростков.",
        "scary": "Великая депрессия в США привела к массовым беспорядкам и экономическим проблемам."
    },
    "1931": {
        "funny": "Появление модных цветов и элементов стало предметом шуток среди молодежи.",
        "scary": "К кризису в американской экономике добавились политические волнения."
    },
    "1930": {
        "funny": "Люди начали создавать комиксы о НЛО, и они стали предметом пародий.",
        "scary": "Массовая безработица напугала всю страну во времена Великой депрессии."
    },
    "1929": {
        "funny": "Ситуации с привычками на рынке стали основой для множества шуток.",
        "scary": "Крах фондового рынка спровоцировал начало Великой депрессии."
    },
    "1928": {
        "funny": "Киноманьяки начали шутить о смешных и голливудских персонах.",
        "scary": "Чума в различных странах начала нанести вред населению."
    },
    "1927": {
        "funny": "Первый релиз звукового кино вызвал много шуток о новом формате.",
        "scary": "События в Малой Азии привели к гуманитарной катастрофе."
    },
    "1926": {
        "funny": "Разнообразие модных причесок стало источником шуток среди молодежи.",
        "scary": "Смерть многих знаменитостей стала шоком для общества."
    },
    "1925": {
        "funny": "Популярные фильмы про Кинга-Конга стали расхожим шутливым моментом.",
        "scary": "Большое количество природных катастроф вызвало общественный страх."
    },
    "1924": {
        "funny": "Культура блюза и джаза привела к множество комических ситуаций в клубах.",
        "scary": "Боевые действия привели к большей агрессии в различных странах."
    },
    "1923": {
        "funny": "Новая мода на танцы создала множество забавных ситуаций на вечеринках.",
        "scary": "Восстания, связанные с борьбой за независимость, привели к опасным последствиям."
    },
    "1922": {
        "funny": "Премьера фильмов с комедийными персонажами привела к общему веселью.",
        "scary": "Обострение отношений между государствами угрожало миру."
    },
    "1921": {
        "funny": "Смешные наряды участниц модных недель стали поводом для комиксов.",
        "scary": "Экономические проблемы привели к росту преступности в городах."
    },
    "1920": {
        "funny": "Танцы в стиле 'флэп' создали массу комических происходящих ситуаций.",
        "scary": "Наступление известного гриппа испугало многих людей."
    },
    "1919": {
        "funny": "Популярные шутки о модных нарядах на 'выпускных вечерах' процветали.",
        "scary": "Гигиенические проблемы после войны стали серьезной угрозой для населения."
    },
    "1918": {
        "funny": "Рождение новых фраз и шуток на основе войны создало необычайный стиль.",
        "scary": "Массовая гибель под воздействием испанского гриппа вызвала страх."
    },
    "1917": {
        "funny": "Год революции стал источником множества комических ситуаций.",
        "scary": "События в России привели к большому неудобству для общества."
    },
    "1916": {
        "funny": "Открытие множеств театров с комедийными адаптациями стало тронуло сердца.",
        "scary": "Первая мировая война продолжала забирает миллионы жизней."
    },
    "1915": {
        "funny": "Недоразумения из школьных программ стали основанием для множества шуток.",
        "scary": "Ситуация с беженцами привела к усилению страха среди населения."
    },
    "1914": {
        "funny": "Первые мобильные библиотеки стали причиной странных ситуаций в обществе.",
        "scary": "Начало Первой мировой войны стало катастрофой для миллионов людей."
    },
    "1913": {
        "funny": "Внедрение новых модных течений в нарядах привело к множеству шуток.",
        "scary": "Ситуация с напряжением в Европе вылилась в тревогу."
    },
    "1912": {
        "funny": "Развлекательные индустрии начали активное использование комедийных шуток.",
        "scary": "Кораблекрушение Титаника стало шоком для всего мира."
    },
    "1911": {
        "funny": "Появление новых жанров кино стало истоком для комичных ситуаций.",
        "scary": "Проблемы с мировым рынком угрожали экономике стран."
    },
    "1910": {
        "funny": "Год появления первых реалистичных комиксов стал причиной смеха.",
        "scary": "Ситуация с запусками первых космических ракетообразных изделий вызвала новые страхи."
    },
    "1909": {
        "funny": "Смешные истории из кафе сделали популярными шутки среди местных жителей.",
        "scary": "Обострение международных отношений стало причиной войны."
    },
    "1908": {
        "funny": "Популярность первых блестящих автомобилей стала источником шуток.",
        "scary": "Массовые катастрофы от стихийных бедствий привели к исчезновению сел."
    },
    "1907": {
        "funny": "Год начала моды на пышные прически женщин стал основой для шуток.",
        "scary": "Политические конфликты стали причиной страха и неопределенности."
    },
    "1906": {
        "funny": "Развлекательные мероприятия с комическими номерами стали популярными.",
        "scary": "Землетрясение в Сан-Франциско привело к масштабным разрушениям."
    },
    "1905": {
        "funny": "Первые карикатуры стали изощренно рассмешивать общество.",
        "scary": "Рабочие протесты привели к тяжелым последствиям и столкновениям с властями."
    },
    "1904": {
        "funny": "Начало использования воздушных шаров стало источником множество шуток о полетах.",
        "scary": "Проблемы с колониальной политикой привели к международным конфликтам."
    },
    "1903": {
        "funny": "Строительство первых театров стало поводом для множества шуток.",
        "scary": "Первая пробы воздуха на больших высотах обострила страхи населения."
    },
    "1902": {
        "funny": "События с историческими реконструкциями показали комические недостатки общества.",
        "scary": "Научные открытия о болезни напугали людей по всему миру."
    },
    "1901": {
      "funny": "Смешные сценарии начинающей киноиндустрии породили множество комичных персонажей.",
      "scary": "События в Африке привели к конфликтам и агрессивной политике."
    },
      "1999": {
        "funny": "Сетевые гуру провозгласили ловлю 'медведей' и 'зайцев' в интернет-культуре.",
        "scary": "С приближением нового тысячелетия мир переживал волнение о том, как компьютеры будут обрабатывать год 2000."
    },
    "1998": {
        "funny": "Популярность мемов о кукле Барби достигла пика, когда ее стали называть 'Барби-девочкой'.",
        "scary": "Финансовый кризис в России вызвал панику на рынках и международном уровне."
    },
    "1997": {
        "funny": "Премьера фильма 'Пираты Карибского моря' стала популярной, и костюмы пиратов заполнили вечеринки.",
        "scary": "События, связанные с расстрелом в школе Падук, пошатнули уверенность в безопасности учебных заведений."
    },
    "1996": {
        "funny": "Люди начали массово распечатывать фразовые мемы на футболках.",
        "scary": "Ураган Флойд вызвал масштабные разрушения и эвакуацию в нескольких штатах США."
    },
    "1995": {
        "funny": "Популярный мультфильм 'Том и Джерри' снова появился в эфире и рассмешил новое поколение;",
        "scary": "Атака на Оклахома-сити стала одной из самых разрушительных терактов в истории США."
    },
    "1994": {
        "funny": "Американские комики начали подшучивать над событиями в новостях, создавая комедийные шоу.",
        "scary": "Генеральные выборы в Югославии привели к гражданской войне и конфликтам."
    },
    "1993": {
        "funny": "Скандал вокруг молока с нежелательными добавками стал темой для шуток.",
        "scary": "Убежище в Беслане стало одной из самых страшных трагедий с многочисленными жертвами."
    },
    "1992": {
        "funny": "Получение диплома стало предметом веселых шуток среди студентов.",
        "scary": "Во время операции 'В единстве сила', на мирные жители в значительной степени также пострадали."
    },
    "1991": {
        "funny": "Прохождение мимо представления бродячей труппы эксцентричных комиков стало популярным.",
        "scary": "Гражданская война в Югославии привела ко множеству жертв и гуманитарной катастрофе."
    },
    "1990": {
        "funny": "Появление первых мобильных телефонов стало основой для множества шуток о 'трубках'.",
        "scary": "Разрушения от урагана 'Андрю' внесли ужас в жизнь многих людей в Флориде."
    },
    "1989": {
        "funny": "Падение Берлинской стены показало, что люди способны делать странные вещи ради свободы.",
        "scary": "Разрушительные события на площади Тяньаньмэнь обрели международный резонанс."
    },
    "1988": {
        "funny": "Массовая популярность роликовых коньков привела к множеству забавных происшествий.",
        "scary": "События с приведением к власти в Аравии стали источником множества страха в регионе."
    },
    "1987": {
        "funny": "Произошел инцидент укус 87 в пиццерии фазбер.",
        "scary": "Забастовка шахтеров в Великобритании вызвала широкий общественный резонанс."
    },
    "1986": {
        "funny": "Популярные телешоу с куклами начали собирать игру в просмотр как увлечение.",
        "scary": "Авария на Чернобыльской АЭС стала одной из самых серьезных техногенных катастроф в истории."
    },
    "1985": {
        "funny": "Становление поп-культуры с хитом 'We Are the World' привело к проблемам со звездами.",
        "scary": "Забойный грипп, известный как 'свиной', начал распространяться по всему миру."
    },
    "1984": {
        "funny": "Год, когда странные наряды и прически стали модными у молодежи.",
        "scary": "Странные события на фоне холодной войны начали угрожать мировой стабильности."
    },
    "1983": {
        "funny": "Люди начали шутить о снах, связанных с глобальным потеплением.",
        "scary": "Противостояние между США и СССР обострилось, добавив нестабильности в международные отношения."
    },
    "1982": {
        "funny": "Значительная популярность видеоигр привела к странным социальным ситуациям.",
        "scary": "Начало холодной войны между Кореей, вызвавшее масштабное напряжение."
    },
    "1981": {
        "funny": "Скандалы вокруг рок-н-ролла стали предметом обсуждения шуток среди подростков.",
        "scary": "Стачка шахтеров в Великобритании привела к массовым протестам и беспорядкам."
    },
    "1980": {
        "funny": "Появление 'диско' привело к множеству забавных танцевальных ситуаций.",
        "scary": "События на Олимпийских играх в Москве вылились в международный бойкот на фоне дипломатии."
    },
    "1979": {
        "funny": "Названия таких акул, как 'синяя акула', стали шуткой в магазинах.",
        "scary": "Кризис в Иране вызвал множество волнений и волну миграции."
    },
    "1978": {
        "funny": "Появление Гонконгского кино привело к абсурдным комедийным кроссоверам.",
        "scary": "События в Латинской Америке обострили вопросы прав человека."
    },
    "1977": {
        "funny": "Популярные музыкальные тенденции, такие как диско, завоевали молодежь своих временем.",
        "scary": "Экологические проблемы начали всплывать в общественном сознании."
    },
    "1976": {
        "funny": "Чебурашка окончательно превратился в комикс среди всех возрастовых групп.",
        "scary": "В мире начались обострения через изменения власти и территориальные споры."
    },
    "1975": {
        "funny": "Мужские стрижки с длинными волосами стали источником шуток среди шутников.",
        "scary": "События в Вьетнаме напоминали об ужасах войны и ее последствиях."
    },
    "1974": {
        "funny": "Появление 'слишком обширных' телепередач ужасов стало комической трагедией.",
        "scary": "Кризис в Ливане охватил страну внутренними конфликтами и насилием."
    },
    "1973": {
        "funny": "Культура выросла вокруг неправдоподобных источников информации о чудесах.",
        "scary": "Ситуация на Ближнем Востоке обострилась и стала достоянием международного сообщества."
    },
    "1972": {
        "funny": "Процветание культов в молодежных кругах стало предметом для обсуждений и шуток.",
        "scary": "Преступления в Бразилии увеличили количество насилия и беспорядков в обществе."
    },
    "1971": {
        "funny": "Люди начали шутить о высоких ценах на страховые полисы для автомобилей.",
        "scary": "На Кубе возникла угроза социалистической идеологии."
    },
    "1970": {
        "funny": "Дискотечные ночные клубы становятся настоящими местами для забав и веселья.",
        "scary": "Во время войн в Афганистане многие люди потеряли свои дома и средства к существованию."
    },
    "1969": {
        "funny": "Люди начали перенимать стиль поведения эстрадных звёзд, что создало множество комических ситуаций.",
        "scary": "События вокруг 'Лунной посадки' стали предметом многочисленных теорий заговора."
    },
    "1968": {
        "funny": "Картинки с 'блестящими' стрижками стали мемами среди молодёжи.",
        "scary": "Гражданская война в США создала серьезные беспорядки в обществе."
    },
    "1967": {
        "funny": "Популярность популярной музыки и рок-н-ролла создала множество комических эксцессов.",
        "scary": "Противостояние холодной войны снова заставило людей заранее опасаться новых угроз."
    },
    "1966": {
        "funny": "Люди начали вести блоги о забавных происшествиях в их повседневной жизни.",
        "scary": "Обострение международных конфликтов высветило в мире вопросы прав человека."
    },
    "1965": {
        "funny": "Появление первых цветных телевизоров стало поводом для шуток о 'цветных' снах.",
        "scary": "События вокруг Вьетнамской войны вызвали массовые протесты по всему миру."
    },
    "1964": {
        "funny": "Разнообразие модных тенденций создало множество веселых и странных стилей.",
        "scary": "Убийство Мартина Лютера Кинга подорвало надежды на мир и равенство."
    },
    "1963": {
        "funny": "Скандалы вокруг кастомизации автомобилей стали предметом шуток среди водителей.",
        "scary": "Убийство президента Кеннеди шокировало всю страну и мир."
    },
    "1962": {
        "funny": "Модные конкурсы пришли в дом каждого, создав комические ситуации.",
        "scary": "Ситуация на Кубе угрожала мировой безопасности."

    },
    "1961": {
        "funny": "Нескладные дизайны одежды стали источником шуток у молодежи.",
        "scary": "Начало холодной войны создало много страхов и неопределенности."
    },
    "1960": {
        "funny": "Танцы в стиле 'джайв' стали основой для множества веселых видео.",
        "scary": "Глобальные противоречия и конфликты начали влиять на экономику."
    },
    "1959": {
        "funny": "Популярность черно-белого телевидения привела к комическим передачам.",
        "scary": "Создание натуральной статистики о доходах и благосостоянии открыло мрачные страницы истории."
    },
    "1958": {
        "funny": "Первые соревнования по 'американскому футболу' создали множество забавных клеток.",
        "scary": "Девальвация валюты в экономике привела к последствиям, затрагивающим простых граждан."
    },
    "1957": {
        "funny": "Появление первых 'моя кактус' мемов стало популярным.",
        "scary": "Наступление холодной войны угрожало мирной стабильности."
    },
    "1956": {
        "funny": "Скандалы вокруг моды на хиппи и 'Модную жизнь' заполнили молодежные журналы.",
        "scary": "Обострение конфликта во Вьетнаме угрожало благосостоянию стран."
    },
    "1955": {
        "funny": "Популярность мыльных опер привела к комическим ситуациям с главными героями.",
        "scary": "События в Соединенных Штатах повысили уровень расовых конфликтов."
    },
    "1954": {
        "funny": "Первый концерт 'Битлз' привел к множеству комических переживаний среди зрителей.",
        "scary": "Симптомы рака и другие тяжелые болезни начали вызывать больше беспокойства."
    },
    "1953": {
        "funny": "Первые комиксы стали основой для шуток среди молодежи.",
        "scary": "Международная напряженность из-за кубинской революции стала предметом беспокойства."
    },
    "1952": {
        "funny": "Летящие тарелки стали объектом шуток в популярных телевизионных шоу.",
        "scary": "Военные конфликты в Корее угрожали международной безопасности."
    },
    "1951": {
        "funny": "Социальные стереотипы по поводу 'хороших' и 'плохих' семей стали причиной многих шуток.",
        "scary": "Начало холодной войны угрожало миру и стабильности государств."
    },
    "1950": {
      "funny": "Обсуждения о моде на челку и низкие линии одежды стали привычными.",
      "scary": "Состояние мира после войны вызвало страх перед вооружением и конфликтами."
    },
    "2000": {
        "funny": "Начало нового тысячелетия вызвало массовую истерию, когда люди готовились к возможному концу света.",
        "scary": "Программа Y2K вызвала панику из-за опасений, что компьютеры не смогут обработать переход в новый год."
    },
    "2001": {
        "funny": "Виртуальный питомец Tamagotchi пережил настоящий бум популярности, и всего лишь через пару недель пользователи обнаруживали, что их питомцы пропали.",
        "scary": "Теракты 11 сентября произошли в США, что побудило к глобальным изменениям в безопасности."
    },
    "2002": {
        "funny": "Выпуск фильма 'День сурка' накануне 2 февраля создал привычку у людей отмечать 'День Сурка'.",
        "scary": "Сбой в работе систем защиты в Японии, вызванный вирусом, уничтожил данные множества пользователей."
    },
    "2003": {
        "funny": "Массовая истерия вокруг 'Войны с Ираком' началась из-за неправильных интерпретаций.",
        "scary": "Начала всплывать информация о том, что многие страны разрабатывают биологическое оружие."
    },
    "2004": {
        "funny": "Популярность 'флешмобов' выросла, когда люди стали делать самые странные вещи в общественных местах.",
        "scary": "Стихийные бедствия, такие как цунами в Индийском океане, унесли множество жизней."
    },
    "2005": {
        "funny": "Культ 'топмоделей' завоевал мир, и люди начали подражать странным модным стилям.",
        "scary": "Ураган Катрина разрушил Новый Орлеан, став одной из самых разрушительных природных катастроф в истории США."
    },
    "2006": {
        "funny": "Мемы о 'отправке неудачников в космос' стали популярными в интернет-сообществах.",
        "scary": "Тревога по поводу птичьего гриппа охватила множество стран из-за распространения вируса."
    },
    "2007": {
        "funny": "Появление 'геймеров', которые использовали редкие артефакты для получения статуса в играх.",
        "scary": "Финансовый кризис начал набирать силу, угрожая экономической стабильности стран."
    },
    "2008": {
        "funny": "Мемы, связанные с политиками и 'неудачными моментами', передавались по социальным сетям.",
        "scary": "Глобальный финансовый кризис вызвал массовую безработицу и экономические проблемы во многих странах."
    },
    "2009": {
        "funny": "Вирусные видео с 'падающими котами' стали активно популяризироваться в интернете.",
        "scary": "Разработка вакцины от гриппа A(H1N1) началась после новостей о пандемии."
    },
    "2010": {
        "funny": "В сети появилось множество пародий на песни Lady Gaga, ставших вирусными.",
        "scary": "Землетрясение в Гаити привело к огромным разрушениям и гуманитарному кризису."
    },
    "2011": {
        "funny": "Серия 'Селфи' начала набирать популярность, и люди стали делать смешные селфи в неожиданных местах.",
        "scary": "События Арабской весны и насилие в разных странах вызвали международное беспокойство."
    },
    "2012": {
        "funny": "Массированное внимание на 'конец света' по календарю мая вдохновило людей на создание странных теорий.",
        "scary": "Засуха и глобальное потепление стали причиной множества природных катастроф."
    },
    "2013": {
        "funny": "Появление кучного вайна-подбора случаев при посещении магазинов стало настоящим хитом.",
        "scary": "События в Сирии и использование химического оружия вызвали международное осуждение."
    },
    "2014": {
        "funny": "Люди начали делать смешные реакции на известные мемы 'Кот в шляпе'.",
        "scary": "Конфликт между Россией и Украиной привел к международной напряженности."
    },
    "2015": {
        "funny": "Серия видео с 'неудачниками', которые создавали маски из овощей, завоевала популярность.",
        "scary": "Теракты в Париже всколыхнули мир и привели к терроризму глобального масштаба."
    },
    "2016": {
        "funny": "Люди начали делиться видео с исполнением 'Despacito' в самых неожиданных местах.",
        "scary": "Проблемы с миграцией и кризис беженцев стихийно разгорелись в Европе."
    },
    "2017": {
        "funny": "Мемы о 'неудачных свиданиях' стали популярными в социальных сетях.",
        "scary": "Ураганы 'Харви', 'Ирма' и 'Мария' принесли разрушения в разные части США и Карибского региона."
    },
    "2018": {
        "funny": "Флешмобы без селфи с 'классными питомцами' стали настоящим трендом в интернете.",
        "scary": "Опасности, связанные с изменением климата, стали более заметными по всему миру."
    },
    "2019": {
        "funny": "Популярность мемов с IMG-фотографиями с непредсказуемым результатом резко возросла.",
        "scary": "Пандемия COVID-19 стала глобальной угрозой и вызвала массовую тревогу."
    },
    "2020": {
        "funny": "Люди начали делать мемы о работе и учебе из дома во время карантина.",
        "scary": "Пандемия COVID-19 привела к глобальной блокировке и множеству жертв."
    },
    "2021": {
        "funny": "Спонтанные пародийные шоу о жизни во время карантина стали вирусными.",
        "scary": "Второй год пандемии и рост антипрививочной истерии создали массу проблем в обществе."
    },
    "2022": {
        "funny": "Создание мемов о пост-карантинной жизни с абсурдными ситуациями стало популярным.",
        "scary": "Бросающиеся в глаза последствия изменения климата, такие как наводнения и лесные пожары, стали обычными."
    },
    "2023": {
        "funny": "Тренды, связанные с собаками на TikTok, вдохновили на создание множества забавных видео.",
        "scary": "Эскалация международных конфликтов увеличила уровень мирового беспокойства."
    },
    "2024": {
        "funny": "Люди стали создавать курьезные приложения для планирования планов на будущее, которые регулярно выходят из строя.",
        "scary": "Предостережения о возможных глобальных экономических и климатических потрясениях вселили страх в умы людей."
    }
}